using TeamHost.Domain.Entities;

namespace TeamHost.Persistence.Configurations
{
    public class DatabaseSeeder
    {
        public DatabaseSeeder()
        {
        }

        public static IReadOnlyCollection<Category> Categories()
        {
            return new List<Category>
            {
                new Category
                {
                    Id = 1,
                    Code = "strategy",
                    Name = "Strategy",
                    Description = "Стратегии"
                },
                new Category
                {
                    Id = 2,
                    Code = "adventure",
                    Name = "Adventure",
                    Description = "Приключенческие игры"
                },
                new Category()
                {
                    Id = 3,
                    Code = "horror",
                    Name = "Horror",
                    Description = "Страшные игры"
                },
                new Category()
                {
                    Id = 4,
                    Code = "simulator",
                    Name = "Simulator",
                    Description = "Симулятор"
                },
                new Category()
                {
                    Id = 5,
                    Code = "fighting",
                    Name = "Fighting",
                    Description = "Файтинг"
                }
            };
        }

        public static IReadOnlyCollection<Company> Companies()
        {
            return new List<Company>()
            {
                new Company()
                {
                    Id = 1,
                    Description = "Компания",
                    CountryId = 4,
                    Name = "Ubisoft",
                },
                
                new Company()
                {
                    Id = 2,
                    Description = "Крутаая компания",
                    CountryId = 4,
                    Name = "Valve"
                }
            };
        }
        
        public static IReadOnlyCollection<Platform> Platforms()
        {
            return new List<Platform>
            {
                new Platform()
                {
                    Id = 1,
                    Code = "windows",
                    Name = "Windows",
        
                },
                new Platform()
                {
                    Id = 2,
                    Code = "apple",
                    Name = "Apple",
                },
                new Platform()
                {
                    Id = 3,
                    Code = "PS4",
                    Name = "PlayStation4",
                },
                new Platform()
                {
                    Id = 4,
                    Code = "PS5",
                    Name = "PlayStation5",
                }
            };
        }
       
        public static IReadOnlyCollection<Country> Countries()
        {
            return new List<Country>
            { 
                new Country(1, 36, "АВСТРАЛИЯ", "АВСТРАЛИЯ", "AU", "AUS"),
                new Country(2, 40, "АВСТРИЯ", "АВСТРИЙСКАЯ РЕСПУБЛИКА", "AT", "AUT"),
                new Country(3, 31, "АЗЕРБАЙДЖАН", "РЕСПУБЛИКА АЗЕРБАЙДЖАН", "AZ", "AZE"),
                new Country(4, 8, "АЛБАНИЯ", "РЕСПУБЛИКА АЛБАНИЯ", "AL", "ALB"),
                new Country(5, 12, "АЛЖИР", "АЛЖИРСКАЯ НАРОДНАЯ ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА", "DZ", "DZA"),
                new Country(6, 660, "АНГИЛЬЯ", "АНГИЛЬЯ", "AI", "AIA"),
                new Country(7, 24, "АНГОЛА", "РЕСПУБЛИКА АНГОЛА", "AO", "AGO"),
                new Country(8, 20, "АНДОРРА", "КНЯЖЕСТВО АНДОРРА", "AD", "AND"),
                new Country(9, 10, "АНТАРКТИДА", "АНТАРКТИДА", "AQ", "ATA"),
                new Country(10, 28, "АНТИГУА И БАРБУДА", "АНТИГУА И БАРБУДА", "AG", "ATG"),
                new Country(11, 32, "АРГЕНТИНА", "АРГЕНТИНСКАЯ РЕСПУБЛИКА", "AR", "ARG"),
                new Country(12, 51, "АРМЕНИЯ", "РЕСПУБЛИКА АРМЕНИЯ", "AM", "ARM"),
                new Country(13, 533, "АРУБА", "ОСТРОВ АРУБА", "AW", "ABW"),
                new Country(14, 4, "АФГАНИСТАН", "ПЕРЕХОДНОЕ ИСЛАМСКОЕ ГОСУДАРСТВО АФГАНИСТАН", "AF", "AFG"),
                new Country(15, 44, "БАГАМЫ", "СОДРУЖЕСТВО БАГАМЫ", "BS", "BHS"),
                new Country(16, 50, "БАНГЛАДЕШ", "НАРОДНАЯ РЕСПУБЛИКА БАНГЛАДЕШ", "BD", "BGD"),
                new Country(17, 52, "БАРБАДОС", "БАРБАДОС", "BB", "BRB"),
                new Country(18, 48, "БАХРЕЙН", "КОРОЛЕВСТВО БАХРЕЙН", "BH", "BHR"),
                new Country(19, 112, "БЕЛАРУСЬ", "РЕСПУБЛИКА БЕЛАРУСЬ", "BY", "BLR"),
                new Country(20, 84, "БЕЛИЗ", "БЕЛИЗ", "BZ", "BLZ"),
                new Country(21, 56, "БЕЛЬГИЯ", "КОРОЛЕВСТВО БЕЛЬГИИ", "BE", "BEL"),
                new Country(22, 204, "БЕНИН", "РЕСПУБЛИКА БЕНИН", "BJ", "BEN"),
                new Country(23, 60, "БЕРМУДЫ", "БЕРМУДСКИЕ ОСТРОВА", "BM", "BMU"),
                new Country(24, 100, "БОЛГАРИЯ", "РЕСПУБЛИКА БОЛГАРИЯ", "BG", "BGR"),
                new Country(25, 68, "БОЛИВИЯ", "РЕСПУБЛИКА БОЛИВИЯ", "BO", "BOL"),
                new Country(26, 70, "БОСНИЯ И ГЕРЦЕГОВИНА", "БОСНИЯ И ГЕРЦЕГОВИНА", "BA", "BIH"),
                new Country(27, 72, "БОТСВАНА", "РЕСПУБЛИКА БОТСВАНА", "BW", "BWA"),
                new Country(28, 76, "БРАЗИЛИЯ", "ФЕДЕРАТИВНАЯ РЕСПУБЛИКА БРАЗИЛИЯ", "BR", "BRA"),
                new Country(29, 86, "БРИТАН. ТЕРРИТ.", "БРИТАНСКАЯ ТЕРРИТОРИЯ В ИНДИЙСКОМ ОКЕАНЕ (БРИТ.)", "IO", "IOT"),
                new Country(30, 96, "БРУНЕЙ", "БРУНЕЙ-ДАРУССАЛАМ", "BN", "BRN"),
                new Country(31, 74, "БУВЕ", "ОСТРОВ БУВЕ", "BV", "BVT"),
                new Country(32, 854, "БУРКИНА-ФАСО", "БУРКИНА-ФАСО", "BF", "BFA"),
                new Country(33, 108, "БУРУНДИ", "РЕСПУБЛИКА БУРУНДИ", "BI", "BDI"),
                new Country(34, 64, "БУТАН", "КОРОЛЕВСТВО БУТАН", "BT", "BTN"),
                new Country(35, 548, "ВАНУАТУ", "РЕСПУБЛИКА ВАНУАТУ", "VU", "VUT"),
                new Country(36, 336, "ВАТИКАН", "ПАПСКИЙ ПРЕСТОЛ (ГОСУДАРСТВО-ГОРОД ВАТИКАН)", "VA", "VAT"),
                new Country(37, 348, "ВЕНГРИЯ", "ВЕНГЕРСКАЯ РЕСПУБЛИКА", "HU", "HUN"),
                new Country(38, 862, "ВЕНЕСУЭЛА", "БОЛИВАРИЙСКАЯ РЕСПУБЛИКА ВЕНЕСУЭЛА", "VE", "VEN"),
                new Country(39, 850, "ВИРГИН. О-ВА", "ВИРГИНСКИЕ ОСТРОВА (США)", "VI", "VIR"),
                new Country(40, 92, "ВИРГИН. О-ВА, БРИТАНСКИЕ", "БРИТАНСКИЕ ВИРГИНСКИЕ ОСТРОВА", "VG", "VGB"),
                new Country(41, 16, "ВОСТОЧНОЕ САМОА", "АМЕРИКАНСКОЕ САМОА (США)", "AS", "ASM"),
                new Country(42, 704, "ВЬЕТНАМ", "СОЦИАЛИСТИЧЕСКАЯ РЕСПУБЛИКА ВЬЕТНАМ", "VN", "VNM"),
                new Country(43, 266, "ГАБОН", "ГАБОНСКАЯ РЕСПУБЛИКА", "GA", "GAB"),
                new Country(44, 332, "ГАИТИ", "РЕСПУБЛИКА ГАИТИ", "HT", "HTI"),
                new Country(45, 328, "ГАЙАНА", "РЕСПУБЛИКА ГАЙАНА", "GY", "GUY"),
                new Country(46, 270, "ГАМБИЯ", "РЕСПУБЛИКА ГАМБИЯ", "GM", "GMB"),
                new Country(47, 288, "ГАНА", "РЕСПУБЛИКА ГАНА", "GH", "GHA"),
                new Country(48, 312, "ГВАДЕЛУПА", "ГВАДЕЛУПА (ФР.)", "GP", "GLP"),
                new Country(49, 320, "ГВАТЕМАЛА", "РЕСПУБЛИКА ГВАТЕМАЛА", "GT", "GTM"),
                new Country(50, 254, "ГВИАНА", "ФРАНЦУЗСКАЯ ГВИАНА (ФР.)", "GF", "GUF"),
                new Country(51, 324, "ГВИНЕЯ", "ГВИНЕЙСКАЯ РЕСПУБЛИКА", "GN", "GIN"),
                new Country(52, 624, "ГВИНЕЯ-БИСАУ", "РЕСПУБЛИКА ГВИНЕЯ-БИСАУ", "GW", "GNB"),
                new Country(53, 276, "ГЕРМАНИЯ", "ФЕДЕРАТИВНАЯ РЕСПУБЛИКА ГЕРМАНИЯ", "DE", "DEU"),
                new Country(54, 831, "ГЕРНСИ", "ГЕРНСИ", "GG", "GGY"),
                new Country(55, 292, "ГИБРАЛТАР", "ГИБРАЛТАР (БРИТ.)", "GI", "GIB"),
                new Country(56, 340, "ГОНДУРАС", "РЕСПУБЛИКА ГОНДУРАС", "HN", "HND"),
                new Country(57, 344, "ГОНКОНГ", "СПЕЦИАЛЬНЫЙ АДМИНИСТРАТИВНЫЙ РЕГИОН КИТАЯ ГОНКОНГ", "HK", "HKG"),
                new Country(58, 308, "ГРЕНАДА", "ГРЕНАДА", "GD", "GRD"),
                new Country(59, 304, "ГРЕНЛАНДИЯ", "ГРЕНЛАНДИЯ", "GL", "GRL"),
                new Country(60, 300, "ГРЕЦИЯ", "ГРЕЧЕСКАЯ РЕСПУБЛИКА", "GR", "GRC"),
                new Country(61, 268, "ГРУЗИЯ", "РЕСПУБЛИКА ГРУЗИЯ", "GE", "GEO"),
                new Country(62, 316, "ГУАМ", "ГУАМ (США)", "GU", "GUM"),
                new Country(63, 208, "ДАНИЯ", "КОРОЛЕВСТВО ДАНИЯ", "DK", "DNK"),
                new Country(64, 832, "ДЖЕРСИ", "ДЖЕРСИ", "JE", "JEY"),
                new Country(65, 262, "ДЖИБУТИ", "РЕСПУБЛИКА ДЖИБУТИ", "DJ", "DJI"),
                new Country(66, 212, "ДОМИНИКА", "СОДРУЖЕСТВО ДОМИНИКИ", "DM", "DMA"),
                new Country(67, 214, "ДОМИНИКАНСКАЯ РЕСПУБЛИКА", "ДОМИНИКАНСКАЯ РЕСПУБЛИКА", "DO", "DOM"),
                new Country(68, 818, "ЕГИПЕТ", "АРАБСКАЯ РЕСПУБЛИКА ЕГИПЕТ (АРЕ)", "EG", "EGY"),
                new Country(69, 894, "ЗАМБИЯ", "РЕСПУБЛИКА ЗАМБИЯ", "ZM", "ZMB"),
                new Country(70, 732, "ЗАПАДНАЯ САХАРА", "ЗАПАДНАЯ САХАРА", "EH", "ESH"),
                new Country(71, 716, "ЗИМБАБВЕ", "РЕСПУБЛИКА ЗИМБАБВЕ", "ZW", "ZWE"),
                new Country(72, 376, "ИЗРАИЛЬ", "ГОСУДАРСТВО ИЗРАИЛЬ", "IL", "ISR"),
                new Country(73, 356, "ИНДИЯ", "РЕСПУБЛИКА ИНДИЯ", "IN", "IND"),
                new Country(74, 360, "ИНДОНЕЗИЯ", "РЕСПУБЛИКА ИНДОНЕЗИЯ", "ID", "IDN"),
                new Country(75, 400, "ИОРДАНИЯ", "ИОРДАНСКОЕ ХАШИМИТСКОЕ КОРОЛЕВСТВО", "JO", "JOR"),
                new Country(76, 368, "ИРАК", "РЕСПУБЛИКА ИРАК", "IQ", "IRQ"),
                new Country(77, 364, "ИРАН", "ИСЛАМСКАЯ РЕСПУБЛИКА ИРАН", "IR", "IRN"),
                new Country(78, 372, "ИРЛАНДИЯ", "ИРЛАНДИЯ", "IE", "IRL"),
                new Country(79, 352, "ИСЛАНДИЯ", "РЕСПУБЛИКА ИСЛАНДИЯ", "IS", "ISL"),
                new Country(80, 724, "ИСПАНИЯ", "КОРОЛЕВСТВО ИСПАНИЯ", "ES", "ESP"),
                new Country(81, 380, "ИТАЛИЯ", "ИТАЛЬЯНСКАЯ РЕСПУБЛИКА", "IT", "ITA"),
                new Country(82, 887, "ЙЕМЕН", "ЙЕМЕНСКАЯ РЕСПУБЛИКА", "YE", "YEM"),
                new Country(83, 132, "КАБО-ВЕРДЕ", "РЕСПУБЛИКА КАБО-ВЕРДЕ", "CV", "CPV"),
                new Country(84, 398, "КАЗАХСТАН", "РЕСПУБЛИКА КАЗАХСТАН", "KZ", "KAZ"),
                new Country(85, 136, "КАЙМАН", "ОСТРОВА КАЙМАН", "KY", "CYM"),
                new Country(86, 116, "КАМБОДЖА", "КОРОЛЕВСТВО КАМБОДЖА", "KH", "KHM"),
                new Country(87, 120, "КАМЕРУН", "РЕСПУБЛИКА КАМЕРУН", "CM", "CMR"),
                new Country(88, 124, "КАНАДА", "КАНАДА", "CA", "CAN"),
                new Country(89, 634, "КАТАР", "ГОСУДАРСТВО КАТАР", "QA", "QAT"),
                new Country(91, 404, "КЕНИЯ", "РЕСПУБЛИКА КЕНИЯ", "KE", "KEN"),
                new Country(92, 196, "КИПР", "РЕСПУБЛИКА КИПР", "CY", "CYP"),
                new Country(93, 296, "КИРИБАТИ", "РЕСПУБЛИКА КИРИБАТИ", "KI", "KIR"),
                new Country(94, 156, "КИТАЙ", "КИТАЙСКАЯ НАРОДНАЯ РЕСПУБЛИКА (КНР)", "CN", "CHN"),
                new Country(95, 166, "КОКОСОВЫЕ О-ВА", "КОКОСОВЫЕ (КИЛИНГ) ОСТРОВА", "CC", "CCK"),
                new Country(96, 170, "КОЛУМБИЯ", "РЕСПУБЛИКА КОЛУМБИЯ", "CO", "COL"),
                new Country(97, 174, "КОМОРЫ", "СОЮЗ КОМОРЫ", "KM", "COM"),
                new Country(98, 178, "КОНГО", "РЕСПУБЛИКА КОНГО", "CG", "COG"),
                new Country(99, 180, "КОНГО", "ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА КОНГО", "CD", "COD"),
                new Country(100, 410, "КОРЕЯ", "РЕСПУБЛИКА КОРЕЯ", "KR", "KOR"),
                new Country(101, 408, "КОРЕЯ (КНДР)", "КОРЕЙСКАЯ НАРОДНО-ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА", "KP", "PRK"),
                new Country(102, 188, "КОСТА-РИКА", "РЕСПУБЛИКА КОСТА-РИКА", "CR", "CRI"),
                new Country(103, 384, "КОТ Д'ИВУАР'", "РЕСПУБЛИКА КОТ Д'ИВУАР'", "CI", "CIV"),
                new Country(104, 192, "КУБА", "РЕСПУБЛИКА КУБА", "CU", "CUB"),
                new Country(105, 414, "КУВЕЙТ", "ГОСУДАРСТВО КУВЕЙТ", "KW", "KWT"),
                new Country(106, 417, "КЫРГЫЗСТАН", "РЕСПУБЛИКА КЫРГЫЗСТАН", "KG", "KGZ"),
                new Country(107, 418, "ЛАОС", "ЛАОССКАЯ НАРОДНО-ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА", "LA", "LAO"),
                new Country(108, 428, "ЛАТВИЯ", "ЛАТВИЙСКАЯ РЕСПУБЛИКА", "LV", "LVA"),
                new Country(109, 426, "ЛЕСОТО", "КОРОЛЕВСТВО ЛЕСОТО", "LS", "LSO"),
                new Country(110, 430, "ЛИБЕРИЯ", "РЕСПУБЛИКА ЛИБЕРИЯ", "LR", "LBR"),
                new Country(111, 422, "ЛИВАН", "ЛИВАНСКАЯ РЕСПУБЛИКА", "LB", "LBN"),
                new Country(112, 434, "ЛИВИЯ", "СОЦИАЛИСТИЧЕСКАЯ НАРОДНАЯ ЛИВИЙСКАЯ АРАБСКАЯ ДЖАМАХИРИЯ", "LY", "LBY"),
                new Country(113, 440, "ЛИТВА", "ЛИТОВСКАЯ РЕСПУБЛИКА", "LT", "LTU"),
                new Country(114, 438, "ЛИХТЕНШТЕЙН", "КНЯЖЕСТВО ЛИХТЕНШТЕЙН", "LI", "LIE"),
                new Country(115, 442, "ЛЮКСЕМБУРГ", "ВЕЛИКОЕ ГЕРЦОГСТВО ЛЮКСЕМБУРГ", "LU", "LUX"),
                new Country(116, 480, "МАВРИКИЙ", "РЕСПУБЛИКА МАВРИКИЙ", "MU", "MUS"),
                new Country(117, 478, "МАВРИТАНИЯ", "ИСЛАМСКАЯ РЕСПУБЛИКА МАВРИТАНИЯ", "MR", "MRT"),
                new Country(118, 450, "МАДАГАСКАР", "ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА МАДАГАСКАР", "MG", "MDG"),
                new Country(119, 175, "МАЙОТТА", "МАЙОТТА", "YT", "MYT"),
                new Country(120, 446, "МАКАО", "СПЕЦИАЛЬНЫЙ АДМИНИСТРАТИВНЫЙ РЕГИОН КИТАЯ МАКАО", "MO", "MAC"),
                new Country(121, 807, "МАКЕДОНИЯ", "РЕСПУБЛИКА МАКЕДОНИЯ", "MK", "MKD"),
                new Country(122, 454, "МАЛАВИ", "РЕСПУБЛИКА МАЛАВИ", "MW", "MWI"),
                new Country(123, 458, "МАЛАЙЗИЯ", "МАЛАЙЗИЯ", "MY", "MYS"),
                new Country(124, 466, "МАЛИ", "РЕСПУБЛИКА МАЛИ", "ML", "MLI"),
                new Country(125, 581, "МАЛЫЕ ТИХООК. ОСТРОВА (США)", "МАЛЫЕ ТИХООКЕАНСКИЕ ОТДАЛЕННЫЕ ОСТРОВА (США)",
                    "UM",
                    "UMI"),
                new Country(126, 462, "МАЛЬДИВЫ", "МАЛЬДИВСКАЯ РЕСПУБЛИКА", "MV", "MDV"),
                new Country(127, 470, "МАЛЬТА", "РЕСПУБЛИКА МАЛЬТА", "MT", "MLT"),
                new Country(128, 580, "МАРИАНСКИЕ ОСТРОВА", "СОДРУЖЕСТВО СЕВЕРНЫХ МАРИАНСКИХ ОСТРОВОВ", "MP", "MNP"),
                new Country(129, 504, "МАРОККО", "КОРОЛЕВСТВО МАРОККО", "MA", "MAR"),
                new Country(130, 474, "МАРТИНИКА", "МАРТИНИКА (ФР.)", "MQ", "MTQ"),
                new Country(131, 584, "МАРШАЛЛОВЫ ОСТРОВА", "РЕСПУБЛИКА МАРШАЛЛОВЫ ОСТРОВА", "MH", "MHL"),
                new Country(132, 484, "МЕКСИКА", "МЕКСИКАНСКИЕ СОЕДИНЕННЫЕ ШТАТЫ", "MX", "MEX"),
                new Country(133, 583, "МИКРОНЕЗИЯ", "ФЕДЕРАТИВНЫЕ ШТАТЫ МИКРОНЕЗИИ", "FM", "FSM"),
                new Country(134, 508, "МОЗАМБИК", "РЕСПУБЛИКА МОЗАМБИК", "MZ", "MOZ"),
                new Country(135, 498, "МОЛДОВА", "РЕСПУБЛИКА МОЛДОВА", "MD", "MDA"),
                new Country(136, 492, "МОНАКО", "КНЯЖЕСТВО МОНАКО", "MC", "MCO"),
                new Country(137, 496, "МОНГОЛИЯ", "МОНГОЛИЯ", "MN", "MHG"),
                new Country(138, 500, "МОНТСЕРРАТ", "МОНТСЕРРАТ (БРИТ.)", "MS", "MSR"),
                new Country(139, 104, "МЬЯНМА", "СОЮЗ МЬЯНМА", "MM", "MMR"),
                new Country(140, 516, "НАМИБИЯ", "РЕСПУБЛИКА НАМИБИЯ", "NA", "NAM"),
                new Country(141, 520, "НАУРУ", "РЕСПУБЛИКА НАУРУ", "NR", "NRU"),
                new Country(142, 524, "НЕПАЛ", "КОРОЛЕВСТВО НЕПАЛ", "NP", "NPL"),
                new Country(143, 562, "НИГЕР", "РЕСПУБЛИКА НИГЕР", "NE", "NER"),
                new Country(144, 566, "НИГЕРИЯ", "ФЕДЕРАТИВНАЯ РЕСПУБЛИКА НИГЕРИЯ", "NG", "NGA"),
                new Country(145, 530, "НИДЕРЛАНДСКИЕ АНТИЛЫ", "НИДЕРЛАНДСКИЕ АНТИЛЫ", "AN", "ANT"),
                new Country(146, 528, "НИДЕРЛАНДЫ", "КОРОЛЕВСТВО НИДЕРЛАНДЫ", "NL", "NLD"),
                new Country(147, 558, "НИКАРАГУА", "РЕСПУБЛИКА НИКАРАГУА", "NI", "NIC"),
                new Country(148, 570, "НИУЭ", "РЕСПУБЛИКА НИУЭ", "NU", "NIU"),
                new Country(149, 554, "НОВАЯ ЗЕЛАНДИЯ", "НОВАЯ ЗЕЛАНДИЯ", "NZ", "NZL"),
                new Country(150, 540, "НОВАЯ КАЛЕДОНИЯ", "НОВАЯ КАЛЕДОНИЯ", "NC", "NCL"),
                new Country(151, 578, "НОРВЕГИЯ", "КОРОЛЕВСТВО НОРВЕГИЯ", "NO", "NOR"),
                new Country(152, 574, "НОРФОЛК", "ОСТРОВ НОРФОЛК", "NF", "NFK"),
                new Country(153, 784, "ОБЪЕД. АРАБСКИЕ ЭМИРАТЫ", "ОБЪЕДИНЕННЫЕ АРАБСКИЕ ЭМИРАТЫ", "AE", "ARE"),
                new Country(154, 833, "О-В МЭН", "ОСТРОВ МЭН", "IM", "IMY"),
                new Country(155, 162, "О-В РОЖДЕСТВА", "ОСТРОВ РОЖДЕСТВА (АВСТРАЛ.)", "CX", "CXR"),
                new Country(156, 184, "О-ВА КУКА", "ОСТРОВА КУКА (Н. ЗЕЛ.)", "СК", "COK"),
                new Country(157, 512, "ОМАН", "СУЛТАНАТ ОМАН", "OM", "OMN"),
                new Country(158, 586, "ПАКИСТАН", "ИСЛАМСКАЯ РЕСПУБЛИКА ПАКИСТАН", "PK", "PAK"),
                new Country(159, 585, "ПАЛАУ", "РЕСПУБЛИКА ПАЛАУ", "PW", "PLW"),
                new Country(160, 275, "ПАЛЕСТИНСКАЯ ТЕРРИТОРИЯ, ОККУПИРОВАННАЯ",
                    "ОККУПИРОВАННАЯ ПАЛЕСТИНСКАЯ ТЕРРИТОРИЯ",
                    "PS", "PSE"),
                new Country(161, 591, "ПАНАМА", "РЕСПУБЛИКА ПАНАМА", "PA", "PAN"),
                new Country(162, 598, "ПАПУА - НОВАЯ ГВИНЕЯ", "ПАПУА - НОВАЯ ГВИНЕЯ", "PG", "PNG"),
                new Country(163, 600, "ПАРАГВАЙ", "РЕСПУБЛИКА ПАРАГВАЙ", "PY", "PRY"),
                new Country(164, 604, "ПЕРУ", "РЕСПУБЛИКА ПЕРУ", "PE", "PER"),
                new Country(165, 612, "ПИТКЭРН", "ПИТКЭРН (БРИТ.)", "PN", "PCN"),
                new Country(166, 616, "ПОЛЬША", "РЕСПУБЛИКА ПОЛЬША", "PL", "POL"),
                new Country(167, 620, "ПОРТУГАЛИЯ", "ПОРТУГАЛЬСКАЯ РЕСПУБЛИКА", "PT", "PRT"),
                new Country(168, 630, "ПУЭРТО-РИКО", "ПУЭРТО-РИКО", "PR", "PRI"),
                new Country(169, 638, "РЕЮНЬОН", "РЕЮНЬОН", "RE", "REU"),
                new Country(170, 643, "РОССИЯ", "РОССИЙСКАЯ ФЕДЕРАЦИЯ", "RU", "RUS"),
                new Country(171, 646, "РУАНДА", "РУАНДИЙСКАЯ РЕСПУБЛИКА", "RW", "RWA"),
                new Country(172, 642, "РУМЫНИЯ", "РУМЫНИЯ", "RO", "ROM"),
                new Country(173, 882, "САМОА", "НЕЗАВИСИМОЕ ГОСУДАРСТВО САМОА", "WS", "WSM"),
                new Country(174, 678, "САН-ТОМЕ И ПРИНСИПИ", "ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА САН-ТОМЕ И ПРИНСИПИ", "ST",
                    "STR"),
                new Country(175, 674, "САН-МАРИНО", "РЕСПУБЛИКА САН-МАРИНО", "SM", "SMR"),
                new Country(176, 682, "САУДОВСКАЯ АРАВИЯ", "КОРОЛЕВСТВО САУДОВСКАЯ АРАВИЯ", "SA", "SAU"),
                new Country(177, 748, "СВАЗИЛЕНД", "КОРОЛЕВСТВО СВАЗИЛЕНД", "SZ", "SWZ"),
                new Country(178, 654, "СВЯТАЯ ЕЛЕНА", "ОСТРОВ СВЯТОЙ ЕЛЕНЫ (БРИТ.)", "SH", "SHN"),
                new Country(179, 690, "СЕЙШЕЛЫ", "РЕСПУБЛИКА СЕЙШЕЛЫ", "SC", "SYC"),
                new Country(180, 666, "СЕН-ПЬЕР И МИКЕЛОН", "СЕН-ПЬЕР И МИКЕЛОН (ФР.)", "PM", "SPM"),
                new Country(181, 686, "СЕНЕГАЛ", "РЕСПУБЛИКА СЕНЕГАЛ", "SN", "SEN"),
                new Country(182, 670, "СЕНТ-ВИНСЕНТ И ГРЕНАДИНЫ", "СЕНТ-ВИНСЕНТ И ГРЕНАДИНЫ", "VC", "VCT"),
                new Country(183, 659, "СЕНТ-КИТС И НЕВИС", "ФЕДЕРАЦИЯ СЕНТ-КИТС (СЕНТ-КРИСТОФЕР) И НЕВИС", "KN", "KNA"),
                new Country(184, 662, "СЕНТ-ЛЮСИЯ", "СЕНТ-ЛЮСИЯ", "LC", "LCA"),
                new Country(185, 688, "СЕРБИЯ", "РЕСПУБЛИКА СЕРБИЯ", "RS", "SRB"),
                new Country(186, 702, "СИНГАПУР", "РЕСПУБЛИКА СИНГАПУР", "SG", "SGP"),
                new Country(187, 760, "СИРИЯ", "СИРИЙСКАЯ АРАБСКАЯ РЕСПУБЛИКА", "SY", "SYR"),
                new Country(188, 703, "СЛОВАКИЯ", "СЛОВАЦКАЯ РЕСПУБЛИКА", "SK", "SVK"),
                new Country(189, 705, "СЛОВЕНИЯ", "РЕСПУБЛИКА СЛОВЕНИЯ", "SI", "SVN"),
                new Country(190, 826, "СОЕДИНЕННОЕ КОРОЛЕВСТВО",
                    "СОЕДИНЕННОЕ КОРОЛЕВСТВО ВЕЛИКОБРИТАНИИ И СЕВЕРНОЙ ИРЛАНДИИ", "GB", "GBR"),
                new Country(191, 90, "СОЛОМОНОВЫ О-ВА", "СОЛОМОНОВЫ ОСТРОВА", "SB", "SLB"),
                new Country(192, 706, "СОМАЛИ", "СОМАЛИЙСКАЯ РЕСПУБЛИКА", "SO", "SOM"),
                new Country(193, 736, "СУДАН", "РЕСПУБЛИКА СУДАН", "SD", "SDN"),
                new Country(194, 740, "СУРИНАМ", "РЕСПУБЛИКА СУРИНАМ", "SR", "SUR"),
                new Country(195, 840, "США", "СОЕДИНЕННЫЕ ШТАТЫ АМЕРИКИ", "US", "USA"),
                new Country(196, 694, "СЬЕРРА-ЛЕОНЕ", "РЕСПУБЛИКА СЬЕРРА-ЛЕОНЕ", "SL", "SLE"),
                new Country(197, 762, "ТАДЖИКИСТАН", "РЕСПУБЛИКА ТАДЖИКИСТАН", "TJ", "TJK"),
                new Country(198, 764, "ТАИЛАНД", "КОРОЛЕВСТВО ТАИЛАНД", "TH", "THA"),
                new Country(199, 158, "ТАЙВАНЬ", "ТАЙВАНЬ (В СОСТАВЕ КИТАЯ)", "TW", "TWN"),
                new Country(200, 834, "ТАНЗАНИЯ", "ОБЪЕДИНЕННАЯ РЕСПУБЛИКА ТАНЗАНИЯ (ОРТ)", "TZ", "TZA"),
                new Country(201, 796, "ТЕРКС И КАЙКОС", "ОСТРОВА ТЕРКС И КАЙКОС (БРИТ.)", "TC", "TCA"),
                new Country(202, 626, "ТИМОР-ЛЕСТЕ", "ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА ТИМОР-ЛЕСТЕ", "TP", "TMP"),
                new Country(203, 768, "ТОГО", "ТОГОЛЕЗСКАЯ РЕСПУБЛИКА", "TG", "TGO"),
                new Country(204, 772, "ТОКЕЛАУ", "ТОКЕЛАУ (ЮНИОН) (Н. ЗЕЛ.)", "TK", "TKL"),
                new Country(205, 776, "ТОНГА", "КОРОЛЕВСТВО ТОНГА", "TO", "TON"),
                new Country(206, 780, "ТРИНИДАД И ТОБАГО", "РЕСПУБЛИКА ТРИНИДАД И ТОБАГО", "TT", "TTO"),
                new Country(207, 798, "ТУВАЛУ", "ТУВАЛУ", "TV", "TUV"),
                new Country(208, 788, "ТУНИС", "ТУНИССКАЯ РЕСПУБЛИКА", "TN", "TUN"),
                new Country(209, 795, "ТУРКМЕНИЯ", "ТУРКМЕНИСТАН", "TM", "TKM"),
                new Country(210, 792, "ТУРЦИЯ", "ТУРЕЦКАЯ РЕСПУБЛИКА", "TR", "TUR"),
                new Country(211, 800, "УГАНДА", "РЕСПУБЛИКА УГАНДА", "UG", "UGA"),
                new Country(212, 860, "УЗБЕКИСТАН", "РЕСПУБЛИКА УЗБЕКИСТАН", "UZ", "UZB"),
                new Country(213, 804, "УКРАИНА", "УКРАИНА", "UA", "UKR"),
                new Country(214, 876, "УОЛЛИС И ФУТУНА", "ОСТРОВА УОЛЛИС И ФУТУНА", "WF", "WLF"),
                new Country(215, 858, "УРУГВАЙ", "ВОСТОЧНАЯ РЕСПУБЛИКА УРУГВАЙ", "UY", "URY"),
                new Country(216, 234, "ФАРЕРСКИЕ О-ВА", "ФАРЕРСКИЕ ОСТРОВА (В СОСТАВЕ ДАНИИ)", "FO", "FRO"),
                new Country(217, 242, "ФИДЖИ", "РЕСПУБЛИКА ОСТРОВОВ ФИДЖИ", "FJ", "FJI"),
                new Country(218, 608, "ФИЛИППИНЫ", "РЕСПУБЛИКА ФИЛИППИНЫ", "PH", "PHL"),
                new Country(219, 246, "ФИНЛЯНДИЯ", "ФИНЛЯНДСКАЯ РЕСПУБЛИКА", "FI", "FIN"),
                new Country(220, 238, "ФОЛКЛЕНДСКИЕ О-ВА", "ФОЛКЛЕНДСКИЕ ОСТРОВА (МАЛЬВИНСКИЕ)", "FK", "FLK"),
                new Country(221, 260, "ФР. ЮЖНЫЕ ТЕРРИТОРИИ", "ФРАНЦУЗСКИЕ ЮЖНЫЕ ТЕРРИТОРИИ (ФР.)", "TF", "ATF"),
                new Country(222, 250, "ФРАНЦИЯ", "ФРАНЦУЗСКАЯ РЕСПУБЛИКА", "FR", "FRA"),
                new Country(223, 258, "ФРАНЦУЗСКАЯ ПОЛИНЕЗИЯ", "ФРАНЦУЗСКАЯ ПОЛИНЕЗИЯ (ФР.)", "PF", "PYF"),
                new Country(224, 334, "ХЕРД И МАКДОНАЛЬД", "ОСТРОВ ХЕРД И ОСТРОВА МАКДОНАЛЬД", "HM", "HMD"),
                new Country(225, 191, "ХОРВАТИЯ", "РЕСПУБЛИКА ХОРВАТИЯ", "HR", "HRV"),
                new Country(226, 140, "ЦЕНТР. - АФР. РЕСПУБЛИКА", "ЦЕНТРАЛЬНО-АФРИКАНСКАЯ РЕСПУБЛИКА (ЦАР)", "CF",
                    "CAF"),
                new Country(227, 148, "ЧАД", "РЕСПУБЛИКА ЧАД", "TD", "TCD"),
                new Country(228, 499, "ЧЕРНОГОРИЯ", "РЕСПУБЛИКА ЧЕРНОГОРИЯ", "ME", "MNE"),
                new Country(229, 203, "ЧЕХИЯ", "ЧЕШСКАЯ РЕСПУБЛИКА", "CZ", "CZE"),
                new Country(230, 152, "ЧИЛИ", "РЕСПУБЛИКА ЧИЛИ", "CL", "CHL"),
                new Country(231, 756, "ШВЕЙЦАРИЯ", "ШВЕЙЦАРСКАЯ КОНФЕДЕРАЦИЯ", "CH", "CHE"),
                new Country(232, 752, "ШВЕЦИЯ", "КОРОЛЕВСТВО ШВЕЦИЯ", "SE", "SWE"),
                new Country(233, 744, "ШПИЦБЕРГЕН И ЯН-МАЙЕН", "ШПИЦБЕРГЕН И ЯН-МАЙЕН (НОРВ.)", "SJ", "SJM"),
                new Country(234, 144, "ШРИ-ЛАНКА", "ДЕМОКРАТИЧЕСКАЯ СОЦИАЛИСТИЧЕСКАЯ РЕСПУБЛИКА ШРИ-ЛАНКА", "LK",
                    "LKA"),
                new Country(235, 218, "ЭКВАДОР", "РЕСПУБЛИКА ЭКВАДОР", "EC", "ECU"),
                new Country(236, 226, "ЭКВАТОРИАЛЬНАЯ ГВИНЕЯ", "РЕСПУБЛИКА ЭКВАТОРИАЛЬНАЯ ГВИНЕЯ", "GQ", "GNQ"),
                new Country(237, 248, "ЭЛАНДСКИЕ ОСТРОВА", "ЭЛАНДСКИЕ ОСТРОВА", "AX", "ALA"),
                new Country(238, 222, "ЭЛЬ-САЛЬВАДОР", "РЕСПУБЛИКА ЭЛ-САЛЬВАДОР", "SV", "SLV"),
                new Country(239, 232, "ЭРИТРЕЯ", "ЭРИТРЕЯ", "ER", "ERI"),
                new Country(240, 233, "ЭСТОНИЯ", "ЭСТОНСКАЯ РЕСПУБЛИКА", "EE", "EST"),
                new Country(241, 231, "ЭФИОПИЯ", "ФЕДЕРАТИВНАЯ ДЕМОКРАТИЧЕСКАЯ  РЕСПУБЛИКА ЭФИОПИЯ", "ET", "ETH"),
                new Country(242, 710, "ЮЖНАЯ АФРИКА", "ЮЖНО-АФРИКАНСКАЯ РЕСПУБЛИКА", "ZA", "ZAF"),
                new Country(243, 239, "ЮЖНАЯ ДЖОРДЖИЯ И ЮЖНЫЕ САНДВИЧЕВЫ ОСТРОВА",
                    "ЮЖНАЯ ДЖОРДЖИЯ И ЮЖНЫЕ САНДВИЧЕВЫ ОСТРОВА", "GS", "SGS"),
                new Country(244, 388, "ЯМАЙКА", "ЯМАЙКА", "JM", "JAM"),
                new Country(245, 392, "ЯПОНИЯ", "ЯПОНИЯ", "JP", "JPN")
            };
        }
    }
}
